results/5/bench-deepseek_v4_tp8dp1_speculative-tp8dp1-c64-i2048o512.log

Throughput
note: saving the result JSON to /root/inference-poc/results/5/result-deepseek_v4_tp8dp1_speculative-tp8dp1-c64-i2048o512.json
note: sampling GPU temperature, power and utilization every 2s -> /root/inference-poc/results/5/gpu_telemetry.csv
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x71b130b18d60>, trust_remote_code=False, seed=0, num_prompts=512, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=512, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='localhost', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='deepseek-ai/DeepSeek-V4-Pro-0813', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['ignore_eos=1', 'random_range_ratio=0.0'], result_dir=None, result_filename='/root/inference-poc/results/5/result-deepseek_v4_tp8dp1_speculative-tp8dp1-c64-i2048o512.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-9436ecd4-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-17 14:49:54 [config.py:774] Detected quantization_config.scale_fmt=ue8m0; enabling UE8M0 for DeepGEMM.
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
INFO 08-17 14:49:56 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 512/512 [04:41<00:00,  1.82it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     512       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  281.86    
Total input tokens:                      1050624   
Total generated tokens:                  262144    
Request throughput (req/s):              1.82      
Output token throughput (tok/s):         930.07    
Peak output token throughput (tok/s):    695.00    
Peak concurrent requests:                69.00     
Total token throughput (tok/s):          4657.59   
---------------Time to First Token----------------
Mean TTFT (ms):                          1561.54   
Median TTFT (ms):                        666.81    
P99 TTFT (ms):                           13280.77  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          64.10     
Median TPOT (ms):                        63.95     
P99 TPOT (ms):                           104.54    
---------------Inter-token Latency----------------
Mean ITL (ms):                           145.19    
Median ITL (ms):                         94.17     
P99 ITL (ms):                            488.50    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          34315.74  
Median E2EL (ms):                        33852.52  
P99 E2EL (ms):                           55150.19  
---------------Speculative Decoding---------------
Acceptance rate (%):                     17.40     
Acceptance length:                       2.22      
Drafts:                                  118296    
Draft tokens:                            828072    
Accepted tokens:                         144072    
Per-position acceptance (%):
  Position 0:                            52.06     
  Position 1:                            29.18     
  Position 2:                            17.23     
  Position 3:                            10.41     
  Position 4:                            6.63      
  Position 5:                            4.07      
  Position 6:                            2.22      
==================================================